title: Github integration added to repository
id: 74d9d7e7-3f55-42ae-be9a-aad3cca39290
status: test
description: Detects when an integration is added to a Github repository
author: Crowdalert, Inc
date: 2024-06-19
tags:
  - attack.persistence
  - attack.t1133
  - detection.risk
logsource:
    product: github
    service: audit
detection:
  selection:
    action: integration_installation.repositories_added
  condition: selection
fields:
  - actor
  - repo
level: medium
risk:
  score: 45
