title: AWS EC2 Snapshot Shared Externally
id: bc0d1085-4904-451b-b2c2-be9f18da162e
status: test
description: detects when an AWS EC2 snapshot is shared externally
author: Crowdalert, Inc
date: 2024/06/19
tags:
  - attack.t1537
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
      eventName: ModifySnapshotAttribute
    filter:
      requestParameters.createVolumePermission.add.items.userId|fieldref: recipientAccountId
    condition: selection and not filter
fields:
  - requestParameters.attributeType
  - userIdentity.principalId
falsepositives:
  - AWS admin sharing snapshots with other AWS accounts
level: medium
