title: AWS CloudTrail Update Logging
id: c122cb0a-c42a-4d40-bdb0-01693e6914a3
status: test
description: detects defense evasion by updating CloudTrail logging
author: Crowdalert, Inc
date: 2024/06/19
logsource:
    product: aws
    service: cloudtrail
detection:
  selection:
    eventSource: cloudtrail.amazonaws.com
    eventName: UpdateTrail
  condition: selection
tags:
  - attack.t1562.008
  - attack.t1562
level: medium
