title: AWS IAM Changed Password Policy
id: 910858ba-e0df-4a2b-b9c0-6b59a1d51b01
status: test
description: detects changes to the account password policy
author: Crowdalert, Inc
date: 2024-06-19
logsource:
    product: aws
    service: cloudtrail
detection:
  selection:
    eventSource: iam.amazonaws.com
    eventName:
      - UpdateAccountPasswordPolicy
      - DeleteAccountPasswordPolicy
  condition: selection
tags:
  - attack.t1201
level: high
