title: AWS CreatePolicyVersion allowing all resources
id: 7d1332ed-b1f4-4355-9ea4-70e6fdd87eb8
status: test
description: detects IAM policy allowing access to any resource
references:
  - https://bishopfox.com/blog/privilege-escalation-in-aws
author: Crowdalert, Inc
date: 2024/06/19
tags:
  - attack.t1078.004
  - attack.t1078
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
      eventName: CreatePolicyVersion
      eventSource: iam.amazonaws.com
      errorCode: success
      requestParameters.policyDocument.Statement.Action: \*
    condition: selection
fields:
  - requestParameters.policyDocument
level: medium
