title: AWS RDS Password Reset
id: 90c01294-283f-4a63-8694-5c5acf8e6f79
status: test
description: detects setting a new password for an RDS instance
references:
  - https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Overview.DBInstance.Modifying.html
author: Crowdalert, Inc
date: 2024/06/19
logsource:
    product: aws
    service: cloudtrail
detection:
  selection:
    eventSource: rds.amazonaws.com
    eventName: ModifyDBInstance
    requestParameters.masterUserPassword: "*"
  condition: selection
tags:
  - attack.t1586
  - attack.t1586.003
  - attack.t1110
level: medium
